Управление_закупками/src/Documents/ВнутреннийЗаказ/ВнутреннийЗаказ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВнутреннийЗаказ</name>
  <registerRecords>AccumulationRegister.ОстатокПотребностиПоВнутреннимЗаказам</registerRecords>
  <attributes>
    <name>Уточнение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоставки</name>
    <type>
      <types>EnumRef.ВидПоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПотребности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РабочаяДокументация</name>
    <type>
      <types>CatalogRef.РабочаяДокументация</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСогласования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказСогласованПТО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласовал</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказОтправленВОМТС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправкиЗаказаВОМТС</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправилВОМТС</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныеХарактеристикиНоменклатуры</name>
      <type>
        <types>CatalogRef.ДополнительныеХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияЗаказа</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерений</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказДляКорректировки</name>
      <type>
        <types>DocumentRef.ВнутреннийЗаказ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_закупками/src/CommonModules/ДокументыСервер/Module.bsl
#Область ПрограммныйИнтерфейс

// Функция ищет заказ с точно такимиже реквизитами:
// РабочаяДокументация, ВтдЗаказа, ВариантЗаказа
// Возвращает истина если заказ с такими параметрами уже существует,
// В противном случае возвращает ложь.
Функция НайденДвойникВнутреннегоЗаказа(ВнутреннийЗаказОбъект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВнутреннийЗаказ.Номер КАК Номер
	|ИЗ
	|	Документ.ВнутреннийЗаказ КАК ВнутреннийЗаказ
	|ГДЕ
	|	ВнутреннийЗаказ.РабочаяДокументация = &РабочаяДокументация
	|	И ВнутреннийЗаказ.Уточнение = &Уточнение
	|	И ВнутреннийЗаказ.ВидПоставки = &ВидПоставки
	|	И ВнутреннийЗаказ.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Уточнение", ВнутреннийЗаказОбъект.Уточнение);
	Запрос.УстановитьПараметр("ВидПоставки", ВнутреннийЗаказОбъект.ВидПоставки);
	Запрос.УстановитьПараметр("РабочаяДокументация", ВнутреннийЗаказОбъект.РабочаяДокументация);
	Запрос.УстановитьПараметр("Ссылка", ВнутреннийЗаказОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции
 
Функция ЗаказПроведен(ВнутреннийЗаказ) Экспорт
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВнутреннийЗаказ,"Проведен"); 
	
КонецФункции

Функция ЗаказОтправленВОМТС(ВнутреннийЗаказ) Экспорт    

    Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВнутреннийЗаказ,"ЗаказОтправленВОМТС"); 
	
КонецФункции

Функция ВнутреннийЗаказСуществуетИНеУдален(ВнутреннийЗаказ) Экспорт 
	
	
	Если ВнутреннийЗаказ = Неопределено 
		Или ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВнутреннийЗаказ,"ПометкаУдаления") Тогда 
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина; 	
	
КонецФункции

Функция СтавкаНДСПоУмолчанию() Экспорт

	СтавкаНДС = Константы.СтавкаНДСПоУмолчанию.Получить();
	Возврат СтавкаНДС;
	
КонецФункции

Функция ВалютаПоУмолчанию() Экспорт

	Валюта = Константы.ВалютаПоУмолчанию.Получить();
	Возврат Валюта;
	
КонецФункции

Функция СкладПоУмолчанию() Экспорт

	Склад = Константы.СкладПоУмолчанию.Получить();
	Возврат Склад;
	
КонецФункции

Функция ПолучитьПорядковыйНомерНовогоЭлементаТабличнойЧасти(ДокументОбъект, ИмяТабличнойЧасти, ИмяРеквизитаПорядковыйНомер, НомерПервойЗаписи = 1) Экспорт        
	
	Если ДокументОбъект[ИмяТабличнойЧасти].Количество() = 0 Тогда        
		Возврат НомерПервойЗаписи;    
	КонецЕсли;
	
	МаксНомерСтроки = 0; 
	
	Для каждого СтрокаТЧ Из ДокументОбъект[ИмяТабличнойЧасти] Цикл            
		МаксНомерСтроки = Макс(МаксНомерСтроки, СтрокаТЧ[ИмяРеквизитаПорядковыйНомер]);        
	КонецЦикла;
	
	НомерСтроки = МаксНомерСтроки + 1;
	Если НомерСтроки = 1 Тогда 
		Возврат НомерПервойЗаписи;
	Иначе		
		Возврат НомерСтроки;
	КонецЕсли;
	
	
КонецФункции

	
#КонецОбласти
